alias.org
#+INCLUDE: ./main.setup
#+TITLE: alias
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* 摘要
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: zh
  :END:      

** 介绍
  :PROPERTIES: 
  :LANG: zh
  :END:    


** 特点
  :PROPERTIES: 
  :LANG: zh
  :END:    

# * How to Install
#   :PROPERTIES: 
#   :CUSTOM_ID: how-to-install
#   :LANG_EN:  How to Install
#   :LANG_ES:  Cómo instalar
#   :LANG_KO:  설치 방법
#   :LANG_ZH:  如何安装
#   :LANG_JA:  インストール方法
#   :END:      

# ** Prerequisites
#    :PROPERTIES: 
#    :CUSTOM_ID: prerequisites
#    :LANG_EN:  Prerequisites
#    :LANG_ES:  Requisitos previos
#    :LANG_KO:  필요 사항
#    :LANG_ZH:  先决条件
#    :LANG_JA:  前準備
#    :END:      

# ** Install
#   :PROPERTIES: 
#   :CUSTOM_ID: install
#   :LANG_EN:  Install
#   :LANG_ES:  Instalar
#   :LANG_KO:  설치
#   :LANG_ZH:  安装
#   :LANG_JA:  インストール
#   :END:      

# ** Installed Packages
#    :PROPERTIES: 
#    :CUSTOM_ID: packages
#    :LANG_EN:  Installed Packages
#    :LANG_ES:  Paquetes instalados
#    :LANG_KO:  설치된 패키지
#    :LANG_ZH:  安装的软件包
#    :LANG_JA:  インストールされたパッケージ
#    :END:      

# ** Check
#    :PROPERTIES: 
#    :CUSTOM_ID: check
#    :LANG_EN:  Check
#    :LANG_ES:  Comprobar
#    :LANG_KO:  확인
#    :LANG_ZH:  检查
#    :LANG_JA:  チェック
#    :END:      

* 如何使用
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: zh
  :END:      

** 结构
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: zh
   :END:      

	#+BEGIN_SRC sh
alias [-p] [name[=value] ...]
	#+END_SRC

** 组态
   :PROPERTIES: 
   :CUSTOM_ID: configuration
   :LANG: zh
   :END:      


** 选项
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: zh
   :END:      

- {{{option(-p)}}}

** 例子
   :PROPERTIES: 
   :CUSTOM_ID: examples
   :LANG: zh
   :END:      


	#+BEGIN_SRC sh
$ alias cl='clear'
$ alias ll='ls -l'
$ alias rm='rm -i'
	#+END_SRC

	#+BEGIN_SRC sh
$ ll
	#+END_SRC

#+BEGIN_RESULT
-rw-r--r--  1 dongsoolee  wheel     17  2 21 12:43 CNAME
-rw-r--r--  1 dongsoolee  wheel   2870  2 21 12:43 DNS.org
-rw-r--r--  1 dongsoolee  wheel    984  2 21 12:43 Dockerfile
-rw-r--r--  1 dongsoolee  wheel   2821  2 21 12:43 Makefile
-rw-r--r--  1 dongsoolee  wheel   2870  2 21 12:43 NIS.org
-rw-r--r--  1 dongsoolee  wheel    278  2 21 12:48 README.en.org
-rw-r--r--  1 dongsoolee  wheel    578  2 21 12:49 README.ko.org
-rw-r--r--  1 dongsoolee  wheel    814  2 21 12:43 README.org
-rw-r--r--  1 dongsoolee  wheel  11259  2 21 12:46 README.org.org
-rw-r--r--  1 dongsoolee  wheel   2874  2 21 12:43 SELinux.org
#+END_RESULT

* 相关主题
  :PROPERTIES: 
  :CUSTOM_ID: seealso
  :LANG: zh
  :END:      

- {{{link(bash)}}}

# * References
#   :PROPERTIES: 
#   :CUSTOM_ID: references
#   :LANG_EN:  References
#   :LANG_ES:  Referencias
#   :LANG_KO:  참고자료
#   :LANG_ZH:  参考
#   :LANG_JA:  参考
#   :END:      
