zh/alias.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<title>alias</title>
<!-- 2018-02-25 Sun 05:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="alias - Linux命令">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="alias - Linux命令">
<meta property="og:description" content="">
<meta name="twitter:title" content="alias - Linux命令">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">alias</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">摘要</a>
<ul>
<li><a href="#introduction">介绍</a></li>
<li><a href="#sec-1-2">特点</a></li>
</ul>
</li>
<li><a href="#usage">如何使用</a>
<ul>
<li><a href="#syntax">结构</a></li>
<li><a href="#configuration">组态</a></li>
<li><a href="#options">选项</a></li>
<li><a href="#examples">例子</a></li>
</ul>
</li>
<li><a href="#seealso">相关主题</a></li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview"><a id="sec-1" name="sec-1"></a>摘要</h2>
<div class="outline-text-2" id="text-overview">
</div>

<div id="outline-container-introduction" class="outline-3">
<h3 id="introduction"><a id="sec-1-1" name="sec-1-1"></a>介绍</h3>
<div class="outline-text-3" id="text-introduction">
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">特点</h3>
<div class="outline-text-3" id="text-1-2">

</div>
</div>
</div>

<div id="outline-container-usage" class="outline-2">
<h2 id="usage"><a id="sec-2" name="sec-2"></a>如何使用</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-syntax" class="outline-3">
<h3 id="syntax"><a id="sec-2-1" name="sec-2-1"></a>结构</h3>
<div class="outline-text-3" id="text-syntax">

<div class="org-src-container">

<pre class="src src-sh">alias [-p] [name[=value] ...]
</pre>
</div>
</div>
</div>

<div id="outline-container-configuration" class="outline-3">
<h3 id="configuration"><a id="sec-2-2" name="sec-2-2"></a>组态</h3>
<div class="outline-text-3" id="text-configuration">
</div>
</div>


<div id="outline-container-options" class="outline-3">
<h3 id="options"><a id="sec-2-3" name="sec-2-3"></a>选项</h3>
<div class="outline-text-3" id="text-options">

<ul class="org-ul">
<li><span class="org-programming-option">-p</span>
</li>
</ul>
</div>
</div>

<div id="outline-container-examples" class="outline-3">
<h3 id="examples"><a id="sec-2-4" name="sec-2-4"></a>例子</h3>
<div class="outline-text-3" id="text-examples">


<div class="org-src-container">

<pre class="src src-sh">$ alias <span style="font-weight: bold; font-style: italic;">cl</span>=<span style="font-style: italic;">'clear'</span>
$ alias <span style="font-weight: bold; font-style: italic;">ll</span>=<span style="font-style: italic;">'ls -l'</span>
$ alias <span style="font-weight: bold; font-style: italic;">rm</span>=<span style="font-style: italic;">'rm -i'</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"> $ ll
</pre>
</div>

<pre class="example">
-rw-r--r--  1 dongsoolee  wheel     17  2 21 12:43 CNAME
-rw-r--r--  1 dongsoolee  wheel   2870  2 21 12:43 DNS.org
-rw-r--r--  1 dongsoolee  wheel    984  2 21 12:43 Dockerfile
-rw-r--r--  1 dongsoolee  wheel   2821  2 21 12:43 Makefile
-rw-r--r--  1 dongsoolee  wheel   2870  2 21 12:43 NIS.org
-rw-r--r--  1 dongsoolee  wheel    278  2 21 12:48 README.en.org
-rw-r--r--  1 dongsoolee  wheel    578  2 21 12:49 README.ko.org
-rw-r--r--  1 dongsoolee  wheel    814  2 21 12:43 README.org
-rw-r--r--  1 dongsoolee  wheel  11259  2 21 12:46 README.org.org
-rw-r--r--  1 dongsoolee  wheel   2874  2 21 12:43 SELinux.org
</pre>
</div>
</div>
</div>

<div id="outline-container-seealso" class="outline-2">
<h2 id="seealso"><a id="sec-3" name="sec-3"></a>相关主题</h2>
<div class="outline-text-2" id="text-seealso">

<ul class="org-ul">
<li><a href="./bash.html">bash</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
